DataProcessors/БуферСканирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>БуферСканирования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/БуферСканирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БуферСканирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УчитыватьВОстатках</Name>
					<Comment>Уменьшать отображение остатков товаров на складах </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДлинаРучногоШК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/БуферСканирования/Forms/ФормаОчистки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Пользователь.ТолькоПросмотр = НЕ ПараметрыСеанса.Администратор;
	ЭтотОбъект.Пользователь = гоПользователь();
	ЗаполнитьДерево();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево()
	
	ДеревоБуфера.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Буфер.ДокументОснование КАК ДокументОснование,
		|	Буфер.Номенклатура КАК Номенклатура,
		|	Буфер.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА Буфер.ДокументОснование.Проведен
		|			ТОГДА 0
		|		КОГДА Буфер.ДокументОснование.ПометкаУдаления
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|	РегистрСведений.БуферСканирования КАК Буфер
		|ГДЕ
		|	Буфер.Пользователь = &Пользователь
		|ИТОГИ ПО
		|	ДокументОснование";
		
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		УзелДок = ДеревоБуфера.ПолучитьЭлементы().Добавить();
		УзелДок.ДокументОснование = ВыборкаДокументы.ДокументОснование;
		УзелДок.СостояниеДокумента = ВыборкаДокументы.СостояниеДокумента;
		ВыборкаСерии = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСерии.Следующий() Цикл
			УзелСерия = УзелДок.ПолучитьЭлементы().Добавить();  
			УзелСерия.Номенклатура = ВыборкаСерии.Номенклатура;
			УзелСерия.Серия = ВыборкаСерии.Серия; 
			УзелСерия.СостояниеДокумента = 3;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБуфераПередУдалением(Элемент, Отказ)
	
	// Отменяем стандартное удаление, так как нам нужно контролировать процесс 
	// и удалять данные из БД
	Отказ = Истина;
	
	Идентификатор = Элемент.ТекущаяСтрока;
	Если Идентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДеревоБуфера.НайтиПоИдентификатору(Идентификатор);
	
	// Проверяем, является ли строка узлом 1-го уровня (у нее нет родителя)
	Если СтрокаДерева.ПолучитьРодителя() = Неопределено Тогда
		
		ТекстВопроса = СтрШаблон("%1: %2 ?",  
		                        НСтр("ru = 'Удалить все записи из буфера обмена для документа'; en = 'Delete all buffered records of document'"),
								Строка(СтрокаДерева.ДокументОснование));
						
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтотОбъект, Идентификатор);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		// Блокируем удаление одиночных записей 2-го уровня, как требует ТЗ
		ПоказатьПредупреждение(, НСтр("ru = 'Удалять записи можно только целиком по документу (ветка 1-го уровня)'; en = 'Record deleting is allowed only for whole document (1-st level lines)'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, Идентификатор) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьВеткуИОчиститьРегистр(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВеткуИОчиститьРегистр(Идентификатор)
	
	Узел = ДеревоБуфера.НайтиПоИдентификатору(Идентификатор);
	Если Узел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Физическое удаление записей из независимого регистра сведений
	НаборЗаписей = РегистрыСведений.БуферСканирования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Узел.ДокументОснование);
	
	// Удаляем только записи текущего пользователя
	// (чтобы случайно не затереть чужой буфер с тем же документом)
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	// 2. Визуальное удаление ветки 1-го уровня из дерева на форме
	ДеревоБуфера.ПолучитьЭлементы().Удалить(Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБуфераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)    
	
	Отказ = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ЗаполнитьДерево();
	
КонецПроцедуры
